/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: configini.h
**
** 创   建   人: Chen.Jian (陈健)
**
** 文件创建日期: 2017年3月14日
**
** 描        述:
*********************************************************************************************************/
#ifndef CONFIGINI_H_
#define CONFIGINI_H_

#define BUFFER_SIZE             80                                      /* 读取配置文件时buffer的大小   */
#define FILEBAK                 ".bak"                                  /* 备份文件路径添加             */
#define OFFERWAITE              60                                      /* OFFER等待时间                */

/*********************************************************************************************************
  定义配置信息的结构体
*********************************************************************************************************/
struct serverconfig {
    UINT                uiServer;                                       /*  服务器的IP地址              */
    UINT                uiStart;                                        /*  租约的起始IP地址            */
    UINT                uiEnd;                                          /*  租约的截止IP地址            */
    struct optionset   *poptionsets;                                    /*  DHCP的option选项            */
    UCHAR               ucMac[6];                                       /*  服务器的Mac地址             */
    ULONG               ulOfferWaite;                                   /*  offer等待时间               */
    ULONG               ulLease;                                        /*  租约时间（秒）              */
    ULONG               ulT1;                                           /*  租约T1时间（秒）            */
    ULONG               ulT2;                                           /*  租约T2时间（秒）            */
    CHAR               *pclogfile;                                      /*  日志文件路径                */
    CHAR               *pcLeasefile;                                    /*  租赁文件路径                */
    CHAR               *pcLeasefilebak;                                 /*  租赁文件备份路径            */
    CHAR               *pcInteface;                                     /*  服务器网卡设备              */
};

extern struct serverconfig GserverConfig;                               /*  服务器配置全局变量          */

/*********************************************************************************************************
  选项设置结构体
*********************************************************************************************************/
struct optionset {
    UINT8              *pcData;                                         /* 选项数据指针                 */
    struct optionset   *optionsetNext;                                  /* 指向下一个选项结构体指针     */
};

/*********************************************************************************************************
  功能函数
*********************************************************************************************************/
INT  configRead (VOID *configfile);
VOID  configMemFree (VOID);
#endif /* CONFIGINI_H_ */
/*********************************************************************************************************
  END
*********************************************************************************************************/
