/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: asdefense_common.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 7 月 27 日
**
** 描        述: ARP 防御共用头文件
*********************************************************************************************************/
#ifndef __ASDEFENSE_COMMON_H
#define __ASDEFENSE_COMMON_H


/*********************************************************************************************************
  EXPORT 操作函数声明
*********************************************************************************************************/
VOID asDefenseHandleEntry (INT iCommand, PVOID  pArgBuf);
VOID asDefenseInit (VOID);
VOID asDefenseRecovry (VOID);
INT  asDefenseTableCreate (VOID);
INT  asDefenseUpdateToDb (BOOL  bStatus);

#endif                                                                  /*  __ASDEFENSE_COMMON_H        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
