/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: dns_info.h
**
** 创   建   人: Shen.WenJun (沈文君)
**
** 文件创建日期: 2018 年 7 月 30 日
**
** 描        述: DNS信息头文件
*********************************************************************************************************/

#ifndef __DNS_INFO_H
#define __DNS_INFO_H

#include "libdns_config.h"

/*********************************************************************************************************
** 函数名称: dnsInfoFree
** 功能描述: 释放DNS信息空间
** 输　入  : pDnsHandle  dns句柄
** 输　出  : NONE
** 返　回  : NONE
*********************************************************************************************************/
VOID dnsInfoFree (__PDNS_HANDLE  pDnsHandle);

/*********************************************************************************************************
** 函数名称: dnsShow
** 功能描述: 查询dns信息
** 输　入  : piRecordTotal  dns记录数句柄
** 输　出  : piRecordTotal  dns记录查询结果总数
** 返　回  : dns查询结果句柄
*********************************************************************************************************/
__PDNS_HANDLE dnsShow (INT  *piRecordTotal);

/*********************************************************************************************************
** 函数名称: dnsConfig
** 功能描述: 配置dns
** 输　入  : pDnsHandle  前端传入的参数
** 输　出  : NONE
** 返　回  : PX_ERROR or ERROR_NONE
*********************************************************************************************************/
INT dnsConfig (__PDNS_HANDLE  pDnsHandle);

#endif
