/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: intada_info.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 6 月 23 日
**
** 描        述: 网口定位信息头文件
*********************************************************************************************************/
#ifndef __INTADA_INFO_H_
#define __INTADA_INFO_H_

#include "libintada_config.h"
/*********************************************************************************************************
** 函数名称: libIntAdaCheck
** 功能描述: 检测是否完成定位操作
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : iIntAdaStatus      状态
*********************************************************************************************************/
INT  libIntAdaCheck (VOID);

/*********************************************************************************************************
** 函数名称: libIntAdaGetNetif
** 功能描述: 获取 Web 网口名对应的系统网卡名称
** 输　入  : cpcWebNetifName    前端网卡名称
**           iNetifLen          网卡名称 buff 长度
** 输　出  : pcNetifName        系统网卡名称
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libIntAdaGetNetif (CPCHAR  cpcWebNetifName, PCHAR  cpNetifName, INT  iNetifLen);

/*********************************************************************************************************
** 函数名称: libIntAdaGetWebNetif
** 功能描述: 获取 netif 名称对应的前端网卡名称
** 输　入  : pcWebNetifName    前端网卡名
**           iNetifLen         网卡名称 buff 长度
** 输　出  : cpcNetifName      网卡名称
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libIntAdaGetWebNetif (CPCHAR  cpcNetifName, PCHAR  pcWebNetifName, INT  iNetifLen);

/*********************************************************************************************************
** 函数名称: libIntAdaSet
** 功能描述: 网口位置自定义设置
** 输　入  : pIntAdaSetInfo     定位信息
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libIntAdaSet (__PINT_ADA_SET  pIntAdaSetInfo);

/*********************************************************************************************************
** 函数名称: libIntAdaClear
** 功能描述: 网口删除操作
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libIntAdaClear (VOID);

#endif                                                                  /*  __INTADA_INFO_H_            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
