/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: monitor_info.h
**
** 创   建   人: Chen.HongBang (陈洪邦)
**
** 文件创建日期: 2018 年 7 月 27 日
**
** 描        述: login信息头文件
*********************************************************************************************************/

#ifndef __LOGIN_INFO_H
#define __LOGIN_INFO_H

#include "liblogin_config.h"

/*********************************************************************************************************
** 函数名称: userAdd
** 功能描述: 增加一个用户
** 输　入  : pLoginHandle      用户信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  userAdd (__PLOGIN_HANDLE  pLoginHandle);
/*********************************************************************************************************
** 函数名称: userDelete
** 功能描述: 增加一个用户
** 输　入  : pLoginHandle      用户信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  userDelete (__PLOGIN_HANDLE  pLoginHandle);
/*********************************************************************************************************
** 函数名称: userDisable
** 功能描述: 禁用一个用户
** 输　入  : pLoginHandle      用户信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  userDisable (__PLOGIN_HANDLE  pLoginHandle);
/*********************************************************************************************************
** 函数名称: loginInfoQuery
** 功能描述: 查询登录信息
** 输　入  : NONE
** 输　出  : piRecordTotal     登录信息查询结果总数
** 返　回  : 登录信息数组指针
*********************************************************************************************************/
PVOID  loginInfoQuery (INT  *piRecordTotal);
/*********************************************************************************************************
** 函数名称: loginChangePasswd
** 功能描述: 修改密码
** 输　入  : pLoginHandle      登录入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  loginChangePasswd (__PLOGIN_HANDLE  pLoginHandle);
/*********************************************************************************************************
** 函数名称: loginRecordWrite
** 功能描述: 用户行为记录
** 输　入  : pLoginRecord      用户行为入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  loginRecordWrite (__PLOGIN_RECORD  pLoginRecord);
/*********************************************************************************************************
** 函数名称: loginRecordQuery
** 功能描述: 查询登录信息
** 输　入  : pLoginRecord      用户行为查询条件
** 输　出  : piRecordTotal     用户行为查询结果总数
** 返　回  : 用户行为数组指针
*********************************************************************************************************/
PVOID  loginRecordQuery (__PLOGIN_RECORD  pLoginRecord, INT* piRecordTotal);
/*********************************************************************************************************
** 函数名称: libuserAuthHandle
** 功能描述: 用户认证信息设置
** 输　入  : userAuth           用户配置信息
** 输　出  : NONE
** 返　回  : 认证信息设置是否成功
*********************************************************************************************************/
INT32  libuserAuthHandle (__PUSER_AUTH_SET  pUserAuth);
/*********************************************************************************************************
** 函数名称: libuserAuthGet
** 功能描述: 用户认证权限信息获取
** 输　入  : pcRole             角色名称
** 输　出  : NONE
** 返　回  : 权限信息
*********************************************************************************************************/
PVOID  libuserAuthGet (PCHAR  pcRole);
#endif
