/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: monitor_info.h
**
** 创   建   人: Chen.HongBang (陈洪邦)
**
** 文件创建日期: 2018 年 7 月 16 日
**
** 描        述: monitor信息头文件
*********************************************************************************************************/

#ifndef __MONITOR_INFO_H
#define __MONITOR_INFO_H

#include "libmonitor_config.h"

/*********************************************************************************************************
** 函数名称: monitorInfoFree
** 功能描述: 释放流控数组
** 输　入  : pMonitorArrayTableHead           流控信息数组
** 输　出  : NONE
** 返　回  : NONE
*********************************************************************************************************/
VOID   monitorInfoFree (PVOID pMonitorArrayTableHead);

/*********************************************************************************************************
** 函数名称: monitorShow
** 功能描述: 查询流控信息
** 输　入  : pFlowctlHandle    流控入参信息
** 输　出  : piRecordTotal     流控记录查询结果总数
** 返　回  : 流控查询结果数组指针
*********************************************************************************************************/
PVOID  monitorShow (PTM_STATS  pMonitorHandle, INT* piRecordTotal);

/*********************************************************************************************************
** 函数名称: cpuMemShow
** 功能描述: 查询CPU/MEMORY/在线用户数信息
** 输　入  : pMonitorHandle    监控入参信息
** 输　出  : piRecordTotal     监控记录查询结果总数
** 返　回  : 监控查询结果数组指针
*********************************************************************************************************/
PVOID  cpuMemShow (PTM_STATS  pMonitorHandle, INT* piRecordTotal);

/*********************************************************************************************************
** 函数名称: monitorConfig
** 功能描述: 配置流控
** 输　入  : pFlowctlHandle      流控入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  monitorConfig (PTM_STATS  pMonitorHandle);

/*********************************************************************************************************
** 函数名称: libInternetStatusMonitor
** 功能描述: 获取互联网连接状态
** 输　入  : pMonitorHandle      监控入参信息
** 输　出  : pInternetStatus     互联网连接结果
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT32  libInternetStatusMonitor (__PINTERNET_STATUS  pInternetStatus);

#endif /* __FLOWCTL_INFO_H */
