/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: nat_info.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 6 月 26 日
**
** 描        述: NAT 处理结构头文件
*********************************************************************************************************/
#ifndef __NAT_INFO_H
#define __NAT_INFO_H
#include "libnat_config.h"

/*********************************************************************************************************
  函数声明
*********************************************************************************************************/

/*********************************************************************************************************
** 函数名称: libNatAssNodeGet
** 功能描述: 获取 NAT 端口使用信息
** 输　入  : NONE
** 输　出  : piNatAssNodeTotal  端口总个数
**           piNatAssNodeUse    已经使用的个数
** 返　回  : NONE
*********************************************************************************************************/
INT  libNatAssNodeGet (INT  *piNatAssNodeTotal, INT  *piNatAssNodeUse);

/*********************************************************************************************************
** 函数名称: libNatMapNumGet
** 功能描述: 获取 NAT 端口映射信息个数
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : 条目个数
*********************************************************************************************************/
INT32  libNatMapNumGet (VOID);

/*********************************************************************************************************
** 函数名称: libNatMapGet
** 功能描述: 获取 NAT 端口映射信息 (需要调用 free 释放资源)
** 输　入  : pNatInfoGet        指定获取的条目数
** 输　出  : iNum               条目个数
** 返　回  : pcInfoBuf          map 信息
*********************************************************************************************************/
PVOID  libNatMapGet (__PNAT_INFO_GET  pNatInfoGet, INT  *piNum);

/*********************************************************************************************************
** 函数名称: libNatMapSet
** 功能描述: NAT 端口映射设置
** 输　入  : pcIpString         IP 地址
**           iIpCnt             IP 个数
**           iWanPort           外网端口
**           iLanPort           内网端口
**           cProto             协议类型(IPPROTO_UDP  IPPROTO_TCP)
**           cNatMapHandle      映射对应操作
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libNatMapSet (PCHAR  pcIpString,
                   INT    iIpCnt,
                   INT    iWanPort,
                   INT    iLanPort,
                   CHAR   cProto,
                   CHAR   cNatMapHandle);

/*********************************************************************************************************
** 函数名称: libNatAliasNumGet
** 功能描述: 获取 NAT 别名信息个数
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : 条目个数
*********************************************************************************************************/
INT32  libNatAliasNumGet (VOID);

/*********************************************************************************************************
** 函数名称: libNatAliasGet
** 功能描述: 获取 NAT 别名信息  (需要调用 libReSourceFree 释放资源)
** 输　入  : NONE
** 输　出  : iNum               条目个数
** 返　回  : pcInfoBuf          别名信息
*********************************************************************************************************/
PVOID  libNatAliasGet (__PNAT_INFO_GET  pNatInfoGet, INT  *piNum);

/*********************************************************************************************************
** 函数名称: libNatAliasSet
** 功能描述: 获取 NAT 分片包设置
** 输　入  : pcAlias            别名地址
**           pcLanStart         LAN 起始地址
**           pcLanEnd           LAN 结束地址
**           cNatAssHandle      别名对应操作
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libNatAliasSet (PCHAR  pcAlias, PCHAR  pcLanStart, PCHAR  pcLanEnd, CHAR  cNatAssHandle);

/*********************************************************************************************************
** 函数名称: libNatIpFragSet
** 功能描述: 获取 NAT 分片包设置
** 输　入  : iIpFragType        分片包类型(1 : TCP   2 : UDP   3 : ICMP)
**           iIpFragHandle      分片包类型处理方式(1 : 使能  0： 禁止)
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libNatIpFragSet (CHAR  cIpFragType, CHAR  cIpFragHandle);

/*********************************************************************************************************
** 函数名称: libNatIpFragGet
** 功能描述: 获取 NAT 分片包设置
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : iNatIpFragInfo     NAT 分片包信息
*********************************************************************************************************/
INT  libNatIpFragGet (VOID);

/*********************************************************************************************************
** 函数名称: libNatWanLanConfig
** 功能描述: WAN LAN口配置
** 输　入  : cpNetIfName        网口名称
**           iHandle            处理方式
**           iFunc              网口功能 (0 : WAN  1 : LAN)
** 输　出  : NONE
** 返　回  : NONE
*********************************************************************************************************/
INT  libNatWanLanConfig (PCHAR  pcNetIfName, INT  iNatWanLanHandle, INT  iFunc);
#endif                                                                  /*  __NAT_INFO_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
