/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: npf_info.h
**
** 创   建   人: Shen.WenJun (沈文君)
**
** 文件创建日期: 2018 年 7 月 25 日
**
** 描        述: NPF信息头文件
*********************************************************************************************************/

#ifndef __NPF_INFO_H
#define __NPF_INFO_H

#include "libnpf_config.h"

/*********************************************************************************************************
** 函数名称: npfInfoFree
** 功能描述: 释放npf信息数组
** 输　入  : pNpfArrayHead  npf信息数组头
** 输　出  : NONE
** 返　回  : NONE
*********************************************************************************************************/
VOID npfInfoFree (PVOID pNpfArrayHead);

/*********************************************************************************************************
** 函数名称: npfShow
** 功能描述: 查询npf信息
** 输　入  : pNpfHandle     npf入参信息
** 输　出  : piRecordTotal  npf记录查询结果总数
** 返　回  : npf查询结果数组指针
*********************************************************************************************************/
PVOID npfShow (__PNPF_HANDLE  pNpfHandle, INT* piRecordTotal);

/*********************************************************************************************************
** 函数名称: npfConfig
** 功能描述: 配置npf
** 输　入  : pNpfHandle  npf入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT npfConfig (__PNPF_HANDLE pNpfHandle);

#endif
