/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: situation_info.h
**
** 创   建   人: Bai.QiangQiang (柏强强)
**
** 文件创建日期: 2018 年 10 月 18 日
**
** 描        述:  情景模式管理处理头文件
*********************************************************************************************************/
#ifndef __SITUATION_INFO_H
#define __SITUATION_INFO_H

#include "libsituation_config.h"

/*********************************************************************************************************
** 函数名称: libSituationInfoSave
** 功能描述: 情景模式信息保存
** 输　入  : pSituationInfo  情景模式入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  libSituationInfoSave (__PSITUATION_INFO  pSituationInfo);
/*********************************************************************************************************
** 函数名称: libWanInfoSave
** 功能描述: WAN 信息保存
** 输　入  : pWanPageInfo  WAN 入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  libWanInfoSave (__PWANPAGE_INFO  pWanPageInfo);
/*********************************************************************************************************
** 函数名称: libKidVpnServerInfoSave
** 功能描述: KidVpn Server 信息保存
** 输　入  : pKidVPNServerInfo  KidVPN server 入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  libKidVpnServerInfoSave (__PKIDVPN_SERVER_INFO  pKidVPNServerInfo);
/*********************************************************************************************************
** 函数名称: libKidVpnServerInfoClean
** 功能描述: KidVpn Server 信息清除
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  libKidVpnServerInfoClean (VOID);
/*********************************************************************************************************
** 函数名称: libVpnServConfInfoSave
** 功能描述: KidVpn Server 配置信息保存
** 输　入  : pKidVPNServerInfo  KidVPN server 入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  libVpnServConfInfoSave (__PKIDVPN_SERVER_INFO  pKidVPNServerInfo);
/*********************************************************************************************************
** 函数名称: libKidvpnCancel
** 功能描述: 取消 KidVPN
** 输　入  : iKidVpnType      KidVPN 类型
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libKidvpnCancel (INT  iKidVpnType);
/*********************************************************************************************************
** 函数名称: libOptionalFuncCancel
** 功能描述: 取消可选功能
** 输　入  : iOptFunc      可选功能
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libOptionalFuncCancel (INT  iOptFunc);
/*********************************************************************************************************
** 函数名称: libKidVpnClientInfoSave
** 功能描述: KidVpn Client 信息保存
** 输　入  : pKidVPNClientInfo  KidVPN Client 入参信息
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libKidVpnClientInfoSave (__PKIDVPN_CLIENT_INFO  pKidVPNClientInfo);

#endif                                                                  /*  __SITUATION_INFO_H          */
