/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: updatefirmware_info.h
**
** 创   建   人: Wang.JingShi (王京石)
**
** 文件创建日期: 2018 年 8 月 3 日
**
** 描        述: update firmware头文件
*********************************************************************************************************/
#ifndef __UPDATE_FIRMWARE_INFO_H
#define __UPDATE_FIRMWARE_INFO_H

#include "libupdatefirmware_config.h"

/*********************************************************************************************************
** 函数名称: updateFirmwareConfig
** 功能描述: 更新固件
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT    updateFirmwareConfig (void);

#endif /* __UPDATE_FIRMWARE_INFO_H */
