/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: version_info.h
**
** 创   建   人: Wang.JingShi (王京石)
**
** 文件创建日期: 2018 年 8 月 8 日
**
** 描        述: version信息头文件
*********************************************************************************************************/
#ifndef __VERSION_INFO_H
#define __VERSION_INFO_H

#include "libversion_config.h"

/*********************************************************************************************************
** 函数名称: versionShow
** 功能描述: 查询系统版本
** 输　入  : pVersionHandle     version入参信息
** 输　出  : none
** 返　回  : version查询结果数组指针
*********************************************************************************************************/
PVOID  versionShow (__PVERSION_HANDLE  pVersionHandle, INT*  piRecordTotal);

#endif /* __VERSION_INFO_H */
