/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: route_common.h
**
** 创   建   人: Chen.HongBang (陈洪邦)
**
** 文件创建日期: 2018 年 6 月 22 日
**
** 描        述: vlan信息头文件
*********************************************************************************************************/

#ifndef __VLAN_INFO_H
#define __VLAN_INFO_H

#include "libvlan_config.h"

/*********************************************************************************************************
** 函数名称: vlanInfoFree
** 功能描述: 释放vlan信息数组
** 输　入  : pVlanArrayHead           vlan信息数组头
** 输　出  : NONE
** 返　回  : NONE
*********************************************************************************************************/
VOID   vlanInfoFree (PVOID pVlanListTableHead);
/*********************************************************************************************************
** 函数名称: vlanShow
** 功能描述: 查询vlan信息
** 输　入  : pVlanHandle       vlan入参信息
** 输　出  : piRecordTotal     vlan记录查询结果总数
** 返　回  : vlan查询结果数组指针
*********************************************************************************************************/
PVOID  vlanShow (__PVLAN_HANDLE  pVlanHandle, INT* piRecordTotal);
/*********************************************************************************************************
** 函数名称: vlanConfig
** 功能描述: 配置vlan
** 输　入  : pVlanHandle      vlan入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT    vlanConfig (__PVLAN_HANDLE pVlanHandle);

#endif /* __VLAN_INFO_H */
