/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: vnd_info.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 6 月 26 日
**
** 描        述: 虚拟网卡处理结构头文件
*********************************************************************************************************/
#ifndef __VND_INFO_H
#define __VND_INFO_H

#include "libvnd_config.h"

/*********************************************************************************************************
  函数接口声明
*********************************************************************************************************/
INT    libVndCreate (__PVND_HANDLE  pVndHandle);
PVOID  libVndGetInfo (INT  *piNum);
INT    libVndDel (INT  iVndID);
INT    libGetNetIfIndexByVndid (INT  iVndid, INT  *piNetIfIndex);
INT    libGetVndidByNetIfIndex (INT  iNetIfIndex, INT  *piVndid);
#endif                                                                  /*  __VND_INFO_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
