/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: vndDB.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 5 月 17 日
**
** 描        述: 本目录数据库公用头文件
*********************************************************************************************************/

#ifndef __VND_DB_H
#define __VND_DB_H

#include "libvnd_config.h"
/*********************************************************************************************************
  虚拟网卡数据库函数声明
*********************************************************************************************************/
INT     vndTableCreate (VOID);
INT     vndDelDBItem (INT  iVndID);
INT     vndAddItemToDb (__PVND_HANDLE  pVndInfo);
PVOID   vndGetDBInfo (VOID);
INT     vndGetDBRow (VOID);
UINT32  vndGetInfoById (INT  iVndID, __PVND_HANDLE  pVndInfo);
UINT32  netIfIndexGetByVndId (INT  iVndid, INT  *piNetIfIndex);
UINT32  vndIdGetByNetIfIndex (INT  iNetIfIndex, INT  *piVndid);

#endif                                                                  /* __VND_DB_H                   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
