/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: asdefenseHandle.c
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 7 月 27 日
**
** 描        述: ARP 防御处理
*********************************************************************************************************/
#include <stdlib.h>
#include "msgcomm.h"
#include "asdefense_info.h"

/*********************************************************************************************************
** 函数名称: libAsDefenseHandle
** 功能描述: 使能 / 禁能 ARP 欺骗防御
** 输　入  : bEnFlag            是否允许开启
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libAsDefenseHandle (BOOL  bEnFlag)
{
    return  (requestConfigMsg(OPENRT_GET_ASD_EN_CMD, &bEnFlag, sizeof(bEnFlag)));
}

/*********************************************************************************************************
** 函数名称: libAsDefenseNumGet
** 功能描述: ARP 防御信息个数获取
** 输　入  : ucType             信息类型
** 输　出  : NONE
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  libAsDefenseNumGet (UINT8  ucType)
{
    return  (requestConfigMsg(OPENRT_GET_ASD_NUM_CMD, (PVOID)&ucType, sizeof(ucType)));
}

/*********************************************************************************************************
** 函数名称: libAsDefenseStatusGet
** 功能描述: ARP 防御开启状态获取
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : 开启状态
*********************************************************************************************************/
INT  libAsDefenseStatusGet (VOID)
{
    return  (requestConfigMsg(OPENRT_GET_ASD_STATUS_CMD, NULL, 0));
}

/*********************************************************************************************************
** 函数名称: libAsDefenseInfoGet
** 功能描述: 获取 ARP 防御信息 (需要手动释放内存)
** 输　入  : pGetHandle         arp 防御获取信息操作
** 输　出  : piTotal            条目总数
** 返　回  : ARP 防御信息
*********************************************************************************************************/
PVOID  libAsDefenseInfoGet (__PASDEFENSE_GET  pGetHandle, INT32 *piTotal)
{
    return  requestQueryMsg(OPENRT_GET_ASD_GET_CMD, pGetHandle, sizeof(__ASDEFENSE_GET), piTotal);
}

/*********************************************************************************************************
  END
*********************************************************************************************************/
