/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: interfaceHandle.c
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 6 月 20 日
**
** 描        述: 网口信息获取处理
*********************************************************************************************************/
#include "libcomm.h"
#include "libinterface_config.h"
#include "msgcomm.h"
#include "stdlib.h"

/*********************************************************************************************************
** 函数名称: libInterFaceInfoSet
** 功能描述: 设置指定网口参数
** 输　入  : pInterFaceSetInfo      网口配置参数结构
** 输　出  : NONE
** 返　回  : 是否设置成功
*********************************************************************************************************/
INT  libInterFaceInfoSet (__PNETIF_SET   pInterFaceSetInfo)
{
    return  (requestConfigMsg(OPENRT_NETINFO_SET_CMD, pInterFaceSetInfo, sizeof(__NETIF_SET)));
}

/*********************************************************************************************************
** 函数名称: libAllInterFaceInfoGet
** 功能描述: 网口信息数据获取 (需要调用者自己释放内存)
** 输　入  : NONE
** 输　出  : iNetIfNum          网口个数
** 返　回  : 网口信息内存指针
*********************************************************************************************************/
PVOID  libAllInterFaceInfoGet (INT  *iNetIfNum)
{
    return  (requestQueryMsg(OPENRT_NETINFO_GET_CMD, NULL, 0, iNetIfNum));
}

