/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: timeHandle.c
**
** 创   建   人: Bai.QiangQiang (柏强强)
**
** 文件创建日期: 2018 年 7 月 23 日
**
** 描        述: 系统时间管理处理
*********************************************************************************************************/
#include "SylixOS.h"
#include <stdio.h>
#include <stdlib.h>
#include <sys/un.h>
#include <sys/socket.h>
#include "ping_tool_info.h"
#include "msgcomm.h"
/*********************************************************************************************************
** 函数名称: pingTest
** 功能描述: PING 测试
** 输　入  : pPingHandle    PING 入参信息
** 输　出  : piRecordTotal  结果总数
** 返　回  : 获取 PING 结果结构体指针
*********************************************************************************************************/
PVOID  pingTest (__PPING_HANDLE  pPingHandle, INT  *piRecordTotal)
{
    return  requestQueryMsg(OPENRT_PING_TEST_CMD, pPingHandle, sizeof(__PING_HANDLE), piRecordTotal);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
