/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: timeHandle.c
**
** 创   建   人: Bai.QiangQiang (柏强强)
**
** 文件创建日期: 2018 年 7 月 23 日
**
** 描        述: 系统时间管理处理
*********************************************************************************************************/
#include "SylixOS.h"
#include <stdio.h>
#include <stdlib.h>
#include <sys/un.h>
#include <sys/socket.h>
#include "time_info.h"
#include "msgcomm.h"
/*********************************************************************************************************
** 函数名称: timeShow
** 功能描述: 显示系统时间
** 输　入  : pTmHandle      系统时间入参信息
** 输　出  : piRecordTotal  时间结果总数
** 返　回  : 查询信息结果指针
*********************************************************************************************************/
PVOID  timeShow (__PTIME_HANDLE  pTmHandle, INT  *piRecordTotal)
{
    return  requestQueryMsg(OPENRT_GET_TIME_CMD, pTmHandle, sizeof(__TIME_HANDLE), piRecordTotal);
}
/*********************************************************************************************************
** 函数名称: tmConfig
** 功能描述: 配置系统时间
** 输　入  : pTmHandle      系统时间入参信息
** 输　出  : NONE
** 返　回  : 操作结果
*********************************************************************************************************/
INT  tmConfig (__PTIME_HANDLE  pTmHandle)
{
    return  requestConfigMsg (OPENRT_SET_TIME_CMD, pTmHandle, sizeof(__TIME_HANDLE));
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
