/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: natExec.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 5 月 17 日
**
** 描        述: 本目录操作函数公用头文件
*********************************************************************************************************/

#ifndef __NAT_EXEC_H
#define __NAT_EXEC_H

#include "libnat_config.h"
/*********************************************************************************************************
  操作函数声明
*********************************************************************************************************/
VOID   natRecovry (VOID);
INT    natCfgInit (VOID);
INT    natWanCfg (CPCHAR  cpcWanName);
INT    natLanCfg (CPCHAR  cpcLanName);
INT    natWanLanDelet (CPCHAR  cpcNetIfName);
INT    natMapCfg (__PNAT_MAP_HANDLE  pNatMapHandle);
INT    natAliasCfg (__PNATALIAS_HANDLE  pNatAliasHandle);
INT    natIpFragCfg (__PNAT_IPFRAG_HANDLE  pNatIpFragHandle);

#endif                                                                  /* __NAT_EXEC_H                 */
/*********************************************************************************************************
  END
*********************************************************************************************************/
