/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: hardware_common.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 8 月 2 日
**
** 描        述: 硬件信息获取头文件
*********************************************************************************************************/

#ifndef __HARDWARE_COMMON_H
#define __HARDWARE_COMMON_H

#include "libhw_config.h"

/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
INT32  getHwInfo (__PHW_INFO pHwInfo);
VOID   hwInfoHandleEntry (INT  iCommand, PVOID  pArgBuf);

#endif                                                                  /* __HARDWARE_COMMON_H          */
