/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: situationDB.h
**
** 创   建   人: Bai.QiangQiang (柏强强)
**
** 文件创建日期: 2018 年 10 月 22 日
**
** 描        述: 本目录数据库公用头文件
*********************************************************************************************************/

#ifndef __SITUATION_DB_H
#define __SITUATION_DB_H

#include "libsituation_config.h"
/*********************************************************************************************************
  情景模式总的信息
*********************************************************************************************************/
#define SITUATION_INFO_TABLE            "situationInfo"                 /*  表单名                      */
#define SITUATION_INFO_TABLE_HEAD       "(MODE       TEXT,"         \
                                        "POSITION    TEXT,"         \
                                        "FUNC        INT,"          \
                                        "STATUS      TEXT)"             /*  表单格式                    */
/*********************************************************************************************************
  外网信息存储表单
*********************************************************************************************************/
#define WAN_PAGE_TABLE                  "WanPageInfo"                   /*  表单名                      */
#define WAN_PAGE_TABLE_HEAD             "(WAN_NAME   TEXT,"         \
                                        "MODE        INT,"          \
                                        "USER        TEXT,"         \
                                        "PWD         TEXT,"         \
                                        "IP          TEXT,"         \
                                        "NETMASK     TEXT,"         \
                                        "GATEWAY     TEXT)"             /*  外网信息存储表单格式        */
/*********************************************************************************************************
  KidVPN 服务端信息存储表单
*********************************************************************************************************/
#define KIDVPN_SERV_PAGE_TABLE           "kidvpnServPageInfo"           /*  表单名                      */
#define KIDVPN_SERV_PAGE_TABLE_HEAD      "(PUBLIC_IP TEXT,"         \
                                         "VND_IP     TEXT,"         \
                                         "VND_MSK    TEXT,"         \
                                         "VND_GW     TEXT,"         \
                                         "PASSWD     TEXT,"         \
                                         "AESKEY     TEXT,"         \
                                         "VNDID      INT)"              /*  KidVPN Server 表单格式      */
/*********************************************************************************************************
  KidVPN 客户端信息存储表单
*********************************************************************************************************/
#define KIDVPN_CLI_PAGE_TABLE            "kidvpnCliPageInfo"            /*  表单名                      */
#define KIDVPN_CLI_PAGE_TABLE_HEAD       "(PUBLIC_IP TEXT,"         \
                                         "VND_IP     TEXT,"         \
                                         "VND_MSK    TEXT,"         \
                                         "PASSWD     TEXT,"         \
                                         "AESKEY     TEXT,"         \
                                         "VNDID      INT)"              /*  IidVPN Client 表单格式      */

#endif                                                                  /* __SITUATION_DB_H             */
/*********************************************************************************************************
  END
*********************************************************************************************************/
