/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: interface_common.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 6 月 23 日
**
** 描        述: 网口信息共用头文件
*********************************************************************************************************/
#ifndef __INTERFACE_COMMON_H
#define __INTERFACE_COMMON_H

#include "libinterface_config.h"
/*********************************************************************************************************
  ifparam.ini 操作标志位 cHandle 宏
*********************************************************************************************************/
#define INI_UPDATE_SEC         (1)                                      /*  更新一则 section 信息       */
#define INI_DEL_SEC            (0)                                      /*  删除一则 section 信息       */
/*********************************************************************************************************
  ifparam.ini 更新标志位 uiUpdateFlag 宏
*********************************************************************************************************/
#define IF_INI_ALL_EN          (0xFFFFFFFF)                             /*  更新所有信息                */
#define IF_INI_IP_EN           (1 << 0)                                 /*  更新 IP 信息                */
#define IF_INI_NETMASK_EN      (1 << 1)                                 /*  更新 MASK 信息              */
#define IF_INI_GW_EN           (1 << 2)                                 /*  更新 GW 信息                */
#define IF_INI_MAC_EN          (1 << 3)                                 /*  更新 MAC 信息               */
#define IF_INI_DEFAULT_EN      (1 << 4)                                 /*  更新默认网卡标志            */
#define IF_INI_UP_EN           (1 << 5)                                 /*  更新使能标志                */
#define IF_INI_DHCP_EN         (1 << 6)                                 /*  更新 DHCP 标志              */
/*********************************************************************************************************
  ifparam.ini 信息结构
*********************************************************************************************************/
struct ifparam_info {
    CHAR                       cHandle;                                 /*  INI 操作方式                */
    CHAR                       cDevName[NETIF_NAMESIZE];                /*  接口名称                    */
    ip4_addr_t                 uiIpAddr;                                /*  IP 地址                     */
    ip4_addr_t                 uiNetMask;                               /*  子网掩码                    */
    ip4_addr_t                 uiGateWay;                               /*  网关地址                    */
    UINT8                      ucMac[NETIF_MAX_HWADDR_LEN];             /*  Mac地址                     */
    CHAR                       cDefault;                                /*  设置为默认网卡              */
    CHAR                       cEnable;                                 /*  使能网卡                    */
    CHAR                       cDhcp;                                   /*  DHCP 使能                   */
    UINT32                     uiUpdateFlag;                            /*  更新标志位                  */
};
typedef struct ifparam_info   __IFPARAM_INFO;
typedef struct ifparam_info*  __PIFPARAM_INFO;

/*********************************************************************************************************
  EXPORT 操作函数声明
*********************************************************************************************************/
VOID interFaceHandleEntry (INT iCommand, PVOID  pArgBuf);
INT  ifParamIniFileHandle (__PIFPARAM_INFO   pIfParamInfo);

#endif                                                                  /*  __INTERFACE_COMMON_H        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
