/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: interfaceExec.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 5 月 17 日
**
** 描        述: 本目录操作函数公用头文件
*********************************************************************************************************/

#ifndef __INTADAPTION_EXEC_H
#define __INTADAPTION_EXEC_H

#include "interface_common.h"
/*********************************************************************************************************
  操作函数声明
*********************************************************************************************************/
INT32  ifParamIniFileHandle(__PIFPARAM_INFO   pIfParamInfo);
INT32  netIfInfoGetByOffset(INT   iOffset, __PNETIF_INFO     pNetifInfo);
INT32  netIfInfoGetAll(PCHAR      pcAllNetIfInfoBuff, INT32  iBuffLen);
INT32  netIfInfoSet(__PNETIF_SET  pNetifSetInfo);
INT32  netIfNumGet(VOID);
INT    vndNetIfNumGet(VOID);

#endif                                                                  /* __INTADAPTION_EXEC_H         */
/*********************************************************************************************************
  END
*********************************************************************************************************/
