/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: arpSpoofDefense.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年 7 月 12 日
**
** 描        述: 获取ARP欺骗防御模块信息结构
*********************************************************************************************************/

#ifndef __ARP_SPOOF_DEFENSE_H
#define __ARP_SPOOF_DEFENSE_H

#include "netif/etharp.h"

/*********************************************************************************************************
  防御使能标志宏
*********************************************************************************************************/
#define ARP_SPOOF_DEFENSE_ENABLE           (1)                          /*  使能防御                    */
#define ARP_SPOOF_DEFENSE_DISABLE          (0)                          /*  禁能防御                    */

/*********************************************************************************************************
  获取信息类型
*********************************************************************************************************/
#define ASDEFENSE_GET_ALL           (0)                                 /*  获取所有信息内容            */
#define ASDEFENSE_GET_SPEC          (1)                                 /*  获取有问题信息内容          */

/*********************************************************************************************************
  ARP 防御返回信息结构
*********************************************************************************************************/
struct asdefense_info {
    ip4_addr_t                      uiIpAddr;                           /*  IP地址                      */
    UCHAR                           ucTrueMacAddr[ETHARP_HWADDR_LEN];   /*  正确MAC地址                 */
    UCHAR                           ucConMacAddr[ETHARP_HWADDR_LEN];    /*  冲突MAC地址                 */
    UINT8                           ucFlag;                             /*  当前ARP信息状态标志         */
};
typedef struct asdefense_info      __ASDEFENSE_INFO;
typedef struct asdefense_info     *__PASDEFENSE_INFO;

/*********************************************************************************************************
  获取 ARP 防御信息全局符号表
*********************************************************************************************************/
LW_SYMBOL_EXPORT INT32 asDefenseStatus (VOID);
LW_SYMBOL_EXPORT UINT32 asDefenseGetSpecInfoNum (UINT8  ucInfoType);
LW_SYMBOL_EXPORT INT32 asDefenseGetSpecInfo (INT32  iStartIndex,
                                             INT32  iEndIndex,
                                             UINT8  ucInfoType,
                                             PCHAR  pcBuff,
                                             INT32  iBuffLen);

#endif                                                                  /* __ARP_SPOOF_DEFENSE_H        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
