/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: quagga_common.h
**
** 创   建   人: Bai.QiangQiang (柏强强)
**
** 文件创建日期: 2018 年 9 月 4 日
**
** 描        述: quagga 相关头文件
*********************************************************************************************************/
#ifndef __QUAGGA_COMMON_H
#define __QUAGGA_COMMON_H

/*********************************************************************************************************
  宏定义
*********************************************************************************************************/
#define QUAGGA_PROTO_NUM          (7)                                   /*  quagga 路由协议个数         */
#define QUAGGA_CONF_USING         (2)                                   /*  quagga 配置正在使用中       */
#define QUAGGA_ENABLE             (1)                                   /*  quagga 启用                 */
#define QUAGGA_DISABLE            (0)                                   /*  quagga 停用                 */
#define INVALID_PID               (-1)                                  /*  无效 pid                    */
/*********************************************************************************************************
  quagga 表信息
*********************************************************************************************************/
#define QUAGGA_TABLE              "quagga"                              /*  quagga 表单名               */
#define QUAGGA_TABLE_HEAD         "(NAME       TEXT," \
                                  "STATUS      INT, " \
                                  "PID         INT, " \
                                  "CLIPID      INT)"                    /*  quagga 表单接口             */
/*********************************************************************************************************
  用于 quagga 路由信息的结构
*********************************************************************************************************/
struct quagga_handle {
    CHAR   cName[32];                                                   /*  动态路由协议名              */
    INT    iStatus;                                                     /*  状态：是否启用              */
    pid_t  pid;                                                         /*  进程 pid 号                 */
};
typedef struct quagga_handle  __QUAGGA_HANDLE;
typedef struct quagga_handle  *__PQUAGGA_HANDLE;
/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
INT    quaggaPidGetFromDB(CPCHAR   cpcName, pid_t  *pPid);
INT    quaggaStatusGetFromDB (CPCHAR  cpcName);
INT    quaggaUpdatePidToDb(CPCHAR  cpcName, pid_t   pid);
INT    quaggaTableCreate(VOID);
VOID   quaggaProcDestroy(VOID);
INT    quaggaRecovery(VOID);

#endif                                                                  /* __QUAGGA_COMMON_H            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
