/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: libdhcp_config.h
**
** 创   建   人: Wu.Pengcheng (吴鹏程)
**
** 文件创建日期: 2018 年 7 月 12 日
**
** 描        述: OpenRT DHCP 客户端信息头文件
*********************************************************************************************************/
#ifndef __LIBDHCP_CONFIG_H
#define __LIBDHCP_CONFIG_H

#include "SylixOS.h"
#include "libserver_type.h"
#include "lwip/netif.h"
/*********************************************************************************************************
  DHCP 服务 ID (ACK 用于后期做有效性校验等)
*********************************************************************************************************/
#define OPENRT_DHCPC_HANDLE        (OPEN_RT_DHCP_CONFIG_BASE | 1)       /*  使能 DHCP 客户端            */
#define OPENRT_DHCPC_HANDLE_ACK    (OPEN_RT_DHCP_CONFIG_BASE | 2)       /*  使能 DHCP 客户端应答        */
/*********************************************************************************************************
  DHCP 客户端 HANDLE 宏
*********************************************************************************************************/
#define DHCP_CLIENT_ENABLE         (1)                                  /*  使能 DHCP 客户端            */
#define DHCP_CLIENT_DISABLE        (0)                                  /*  禁能 DHCP 客户端            */
/*********************************************************************************************************
  DHCP 客户端配置操作
*********************************************************************************************************/
struct dhcp_client_set {
    CHAR               cNetifName[NETIF_NAMESIZE];                      /*  网口名称                    */
    CHAR               cHandle;                                         /*  操作类型                    */
};
typedef struct dhcp_client_set  __DHCP_CLIENT_SET;
typedef __DHCP_CLIENT_SET      *__PDHCP_CLIENT_SET;

#endif                                                                  /* __LIBDHCP_CONFIG_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
