/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: libdevname_config.h
**
** 创   建   人: Bai.QiangQiang (柏强强)
**
** 文件创建日期: 2018 年 7 月 23 日
**
** 描        述: 设备名称设置头文件
*********************************************************************************************************/
#ifndef __LIBDEVNAME_CONFIG_H
#define __LIBDEVNAME_CONFIG_H

#include "libserver_type.h"
/*********************************************************************************************************
  设备名称相关命令宏定义 (ACK 用于后期做有效性校验等)
*********************************************************************************************************/
#define OPENRT_SET_DEV_NAME_CMD     (OPEN_RT_DEVNAME_CONFIG_BASE | 1)   /*  设置系统时间命令            */
#define OPENRT_SET_DEV_NAME_ACK_CMD (OPEN_RT_DEVNAME_CONFIG_BASE | 2)   /*  设置系统时间应答命令        */

#define OPENRT_GET_DEV_NAME_CMD     (OPEN_RT_DEVNAME_CONFIG_BASE | 3)   /*  获取系统时间命令            */
#define OPENRT_GET_DEV_NAME_ACK_CMD (OPEN_RT_DEVNAME_CONFIG_BASE | 4)   /*  获取系统时间应答命令        */
/*********************************************************************************************************
 用于设备名称信息的结构
*********************************************************************************************************/
struct devname_handle {
    CHAR cdevName[64];                                                  /*  设备名称                    */
};
typedef struct devname_handle   __DEVNAME_HANDLE;
typedef struct devname_handle  *__PDEVNAME_HANDLE;

#endif                                                                  /*  __LIBDEVNAME_CONFIG_H       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
