/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: libdns_config.h
**
** 创   建   人: Shen.WenJun (沈文君)
**
** 文件创建日期: 2018 年 7 月 30 日
**
** 描        述: DNS 信息头文件
*********************************************************************************************************/
#ifndef __LIBDNS_CONFIG_H
#define __LIBDNS_CONFIG_H

#include "libserver_type.h"
/*********************************************************************************************************
  DNS 操作命令
*********************************************************************************************************/
#define OPENRT_GET_DNS_CMD        (OPEN_RT_DNS_CONFIG_BASE | 1)         /*  获取 DNS 配置命令           */
#define OPENRT_GET_DNS_CMD_ACK    (OPEN_RT_DNS_CONFIG_BASE | 2)         /*  获取 DNS 配置应答命令       */
#define OPENRT_CFG_DNS_CMD        (OPEN_RT_DNS_CONFIG_BASE | 3)         /*  配置 DNS 命令               */
#define OPENRT_CFG_DNS_CMD_ACK    (OPEN_RT_DNS_CONFIG_BASE | 4)         /*  配置 DNS 应答命令           */
/*********************************************************************************************************
  dns配置信息数据结构
*********************************************************************************************************/
struct dns_handle {
    CHAR      primaryDNS[16];                                           /*  首选 DNS 地址               */
    CHAR      secondDNS[16];                                            /*  备选 DNS 地址               */
};
typedef struct dns_handle    __DNS_HANDLE;
typedef struct dns_handle   *__PDNS_HANDLE;

#endif                                                                  /*  __LIBDNS_CONFIG_H           */
/*********************************************************************************************************
   END
*********************************************************************************************************/
