/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: libping_config.h
**
** 创   建   人: Bai.QiangQiang (柏强强)
**
** 文件创建日期: 2018 年 7 月 23 日
**
** 描        述: PING 测试头文件
*********************************************************************************************************/
#ifndef __LIBPING_CONFIG_H
#define __LIBPING_CONFIG_H

#include "libserver_type.h"
#include "lwip/netif.h"

/*********************************************************************************************************
  系统 PING 测试相关命令宏定义 (ACK 用于后期做有效性校验等)
*********************************************************************************************************/
#define OPENRT_PING_TEST_CMD        (OPEN_RT_PING_TEST_CONFIG_BASE | 1)  /*  系统 PING 测试命令         */
#define OPENRT_PING_TEST_ACK_CMD    (OPEN_RT_PING_TEST_CONFIG_BASE | 2)  /*  系统 PING 测试应答命令     */

/*********************************************************************************************************
  用于系统 PING 测试信息的结构
*********************************************************************************************************/
struct ping_handle {
    CHAR  cDomain[128];                                                 /*  IP 或域名                   */
    CHAR  cEnetName[NETIF_NAMESIZE];                                    /*  接口名                      */
    INT   iDataSize;                                                    /*  数据长度                    */
};

typedef struct ping_handle  __PING_HANDLE;
typedef struct ping_handle  *__PPING_HANDLE;

#endif                                                                  /*  __LIBPING_CONFIG_H          */
/*********************************************************************************************************
  END
*********************************************************************************************************/
