/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: libversion_config.h
**
** 创   建   人: Wang.JingShi (王京石)
**
** 文件创建日期: 2018 年 8 月 8 日
**
** 描        述: version 信息头文件
*********************************************************************************************************/

#ifndef __LIBVERSION_CONFIG_H
#define __LIBVERSION_CONFIG_H

#include <netinet/in.h>
#include "libserver_type.h"

/*********************************************************************************************************
  version 服务 ID (ACK 用于后期做有效性校验等)
*********************************************************************************************************/
#define OPENRT_GET_VERSION_CMD      (OPEN_RT_VERSION_CONFIG_BASE | 3)   /*  获取系统version             */
#define OPENRT_GET_VERSION_ACK_CMD  (OPEN_RT_VERSION_CONFIG_BASE | 4)   /*  获取系统version应答         */
/*********************************************************************************************************
 用于 version 信息的结构
*********************************************************************************************************/
struct version_handle {
    CHAR   cVer[100];                                                   /*  版本信息                    */
};
typedef struct version_handle   __VERSION_HANDLE;
typedef struct version_handle  *__PVERSION_HANDLE;

#endif                                                                  /*  __LIBVERSION_CONFIG_H       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
