/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: libcomm.h
**
** 创   建   人: Li.xiaocheng (李孝成)
**
** 文件创建日期: 2018 年 6 月 20 日
**
** 描        述: socket 通信库接口
*********************************************************************************************************/
#ifndef _LIBCOMM_H_
#define _LIBCOMM_H_

#include "SylixOS.h"
#include <stdio.h>

/*********************************************************************************************************
  通讯返回错误定义
*********************************************************************************************************/
#define COMM_OK              (0)                                        /*  通讯成功                    */
#define COMM_ERROR           (-1)                                       /*  发送失败                    */

/*********************************************************************************************************
  BUF 大小
*********************************************************************************************************/
#define  COMM_BUFF_LEN   1024

/*********************************************************************************************************
** 函数名称: initCliCommFd
** 功能描述: 初始化unix 客户端通讯通道
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : NONE
*********************************************************************************************************/
VOID  initCliCommFd (VOID);

/*********************************************************************************************************
** 函数名称: initSerCommFd
** 功能描述: 初始化unix 客户端通讯通道
** 输　入  : NONE
** 输　出  : NONE
** 返　回  : NONE
*********************************************************************************************************/
INT  initSerCommFd (VOID);

/*********************************************************************************************************
** 函数名称: cliSendAndRecv
** 功能描述: 客户端通讯接口，该接口发送完，等待接收数据
** 输　入  : iCommand         发送命令字
**           pvSbuff          发送缓冲区
**           iSbuffLen        发送缓冲区长度
** 输　出  : pvRbuff          接收缓冲区
**           iRbuffLen        接收缓冲区长度
** 返　回  : COMM_ERROR       发送失败
**           COMM_OK          发送成功
*********************************************************************************************************/
INT  cliSendAndRecv (INT iCommand, void *pvSbuff, INT iSbuffLen, void *pvRbuff, INT iRbuffLen);

/*********************************************************************************************************
** 函数名称: clinetRecv
** 功能描述: 客户端通讯接口，用来接收服务器送来的命令字
** 输　入  : pvbuff           接收到命令的缓冲区
**           iBuffLen         缓冲区的长度
** 输　出  : ipCommand        接收到的命令字
**           piRecvLen        实际收到得长度
** 返　回  : COMM_ERROR       发送失败
**           COMM_OK          发送成功
*********************************************************************************************************/
INT  clientRecv (INT  *piCommand, void *pvBuff, INT *piRecvLen, INT iBuffLen);

/*********************************************************************************************************
** 函数名称: clientSend
** 功能描述: 客户端发送接口
** 输　入  : iCommand         发送命令字
**           pvSbuff          发送缓冲区
**           iSbuffLen        发送缓冲区长度
** 输　出  : NONE
** 返　回  : COMM_ERROR       发送失败
**           COMM_OK          发送成功
*********************************************************************************************************/
INT  clientSend (INT iCommand, void *pvSbuff, INT iSbuffLen);

/*********************************************************************************************************
** 函数名称: serverRecv
** 功能描述: 服务端通讯接口，用来接收客户端送来的命令字
** 输　入  : pvbuff           接收到命令的缓冲区
**           iBuffLen         缓冲区的长度
** 输　出  : ipCommand        接收到的命令字
**           piRecvLen        实际收到得长度
** 返　回  : COMM_ERROR       发送失败
**           COMM_OK          发送成功
*********************************************************************************************************/
INT  serverRecv (INT  *piCommand, void *pvBuff, INT *piRecvLen, INT iBuffLen);

/*********************************************************************************************************
** 函数名称: serverSend
** 功能描述: 服务端通讯接口，用来返回处理结果
** 输　入  : iCommand         发送命令字
**           pvSbuff          发送缓冲区
**           iSbuffLen        发送缓冲区长度
** 输　出  : NONE
** 返　回  : COMM_ERROR       发送失败
**           COMM_OK          发送成功
*********************************************************************************************************/
INT  serverSend (INT iCommand, void *pvSbuff, INT iSbuffLen);

#endif                                                                  /* _LIBCOMM_H_                  */
