/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: unixSocket.h
**
** 创   建   人: Wu.PengCheng (吴鹏程)
**
** 文件创建日期: 2018 年6 月 9 日
**
** 描        述: unix 域 socket 使用接口
*********************************************************************************************************/
#ifndef _UNIXSOCKET_H_
#define _UNIXSOCKET_H_

#include "SylixOS.h"

/*********************************************************************************************************
** 函数名称: unixDgramSSocket
** 功能描述: 创建一个 DGRAM 类型的 UNIX 域socket
** 输　入  : cpcPszPath         文件名
** 输　出  : NONE
** 返　回  : iSockfd            socket 描述符
*********************************************************************************************************/
INT unixDgramSocket (CPCHAR  cpcPszPath);


/*********************************************************************************************************
** 函数名称: unixDgramSockAddr
** 功能描述: 生成目的 socket 地址和长度
** 输　入  : cpcDstPath         文件名
** 输　出  : pDst               socket 目的地址
**           iLen               socket 地址长度
** 返　回  : ERROR_CODE
*********************************************************************************************************/
INT  unixDgramSockAddr (CPCHAR  cpcDstPath, struct sockaddr_un  *pDst, INT  *piLen);


#endif                                                                  /* _UNIXSOCKET_H_               */
